Documents/ДвижениеМорозилок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДвижениеМорозилок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМорозилок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОперацииМорозилок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипМестаМорозилок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КудаТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипМестаМорозилок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КудаОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Морозилки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Морозилка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Морозилки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиМорозилок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМорозилок</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Морозилка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Морозилки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипМестаМорозилок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидОперацииМорозилок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидОперацииМорозилок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриходОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДвижениеМорозилок/Ext/ObjectModule.bsl
Перем УжеПроведен;


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// 1) Валидация шапки — как у тебя
	Если НЕ ЗначениеЗаполнено(ВидОперации)
		ИЛИ НЕ ЗначениеЗаполнено(ОткудаТип) ИЛИ НЕ ЗначениеЗаполнено(КудаТип)
		ИЛИ НЕ ЗначениеЗаполнено(ОткудаОбъект) ИЛИ НЕ ЗначениеЗаполнено(КудаОбъект) Тогда
		Сообщить("Заполните Вид операции, Откуда/Куда (тип и объект)."); Отказ = Истина; Возврат;
	КонецЕсли;
	
	Если ОткудаТип = КудаТип И ОткудаОбъект = КудаОбъект Тогда
		Сообщить("Откуда и Куда не могут совпадать."); Отказ = Истина; Возврат;
	КонецЕсли;
	
	Если Морозилки.Количество() = 0 Тогда
		Сообщить("Добавьте хотя бы одну морозилку."); Отказ = Истина; Возврат;
	КонецЕсли;
	
	// 2) Дубли
	МассивПроверки = Новый Массив;
	Для Каждого Стр Из Морозилки Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Морозилка) Тогда
			Сообщить("В табличной части есть пустая строка (морозилка не заполнена)."); Отказ = Истина; Возврат;
		КонецЕсли;
		Если МассивПроверки.Найти(Стр.Морозилка) <> Неопределено Тогда
			Сообщить("Дубль в документе: " + Стр.Морозилка); Отказ = Истина; Возврат;
		КонецЕсли;
		МассивПроверки.Добавить(Стр.Морозилка);
	КонецЦикла;
	
	// 3) Контроль остатков по "Откуда": для всех, КРОМЕ прихода от поставщика
	Если ВидОперации <> Перечисления.ВидОперацииМорозилок.ПриходОтПоставщика Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Морозилки.Ссылка КАК Морозилка
		|ПОМЕСТИТЬ Стр
		|ИЗ
		|	Справочник.Морозилки КАК Морозилки
		|ГДЕ
		|	Морозилки.Ссылка В(&Массив)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Стр.Морозилка КАК Морозилка,
		|	ЕСТЬNULL(Ост.КоличествоОстаток, 0) КАК Остаток
		|ИЗ
		|	Стр КАК Стр
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиМорозилок.Остатки(
		|				,
		|				ТипМеста = &Тип
		|					И МестоОбъект = &Объект) КАК Ост
		|		ПО Стр.Морозилка = Ост.Морозилка");
		
		Запрос.УстановитьПараметр("Массив", Морозилки.ВыгрузитьКолонку("Морозилка"));
		Запрос.УстановитьПараметр("На", Дата);
		Запрос.УстановитьПараметр("Тип", ОткудаТип);
		Запрос.УстановитьПараметр("Объект", ОткудаОбъект);
		
		Рез = Запрос.Выполнить().Выбрать();
		Проблемы = Новый Массив;
		Пока Рез.Следующий() Цикл
			Если Рез.Остаток < 1 Тогда
				Если УжеПроведен Тогда
					Если ЭтотОбъект.Ссылка.Морозилки.Найти(Рез.Морозилка) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				Проблемы.Добавить(Рез.Морозилка);
			КонецЕсли;
		КонецЦикла;
		
		Если Проблемы.Количество() > 0 Тогда
			Сообщить("Нет остатка по 'Откуда' для: " + СтрСоединить(Проблемы, ", "));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	//// 4) Движения: ВСЕГДА минус из Откуда и плюс в Куда (даже для прихода от поставщика)
	//Набор = РегистрыНакопления.ОстаткиМорозилок.СоздатьНаборЗаписей();
	//Набор.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	//Набор.Прочитать();
	//Набор.Очистить(); // важно при перепроведении
	//
	//Для Каждого Стр Из Морозилки Цикл
	//	// Минус по Откуда
	//	Зап = Набор.Добавить();
	//	Зап.Период      = Дата;
	//	Зап.Активность  = Истина;
	//	Зап.Морозилка   = Стр.Морозилка;
	//	Зап.ТипМеста    = ОткудаТип;
	//	Зап.МестоОбъект = ОткудаОбъект;
	//	Зап.Количество  = -1;
	//	
	//	// Плюс по Куда
	//	Зап = Набор.Добавить();
	//	Зап.Период      = Дата;
	//	Зап.Активность  = Истина;
	//	Зап.Морозилка   = Стр.Морозилка;
	//	Зап.ТипМеста    = КудаТип;
	//	Зап.МестоОбъект = КудаОбъект;
	//	Зап.Количество  = 1;
	//КонецЦикла;
	//
	//Набор.Записать();
	//
	//	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//// Данный фрагмент построен конструктором.
	//// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиМорозилок Приход
	Движения.ОстаткиМорозилок.Записывать = Истина;
	Для Каждого ТекСтрокаМорозилки Из Морозилки Цикл
		Движение = Движения.ОстаткиМорозилок.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Морозилка = ТекСтрокаМорозилки.Морозилка;
		Движение.ТипМеста = КудаТип;
		Движение.МестоОбъект = КудаОбъект;
		Движение.Количество = 1;
	КонецЦикла;

	// регистр ОстаткиМорозилок Расход
	Движения.ОстаткиМорозилок.Записывать = Истина;
	Для Каждого ТекСтрокаМорозилки Из Морозилки Цикл
		Движение = Движения.ОстаткиМорозилок.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Морозилка = ТекСтрокаМорозилки.Морозилка;
		Движение.ТипМеста = ОткудаТип;
		Движение.МестоОбъект = ОткудаОбъект;
		Движение.Количество = 1;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	УжеПроведен = ЭтотОбъект.Ссылка.Проведен;
КонецПроцедуры
